netgmm/nailong_ai_robot/firmware/sdkconfig.defaults
# ESP32-S3-Box-3 语音对话终端 —— 默认 sdkconfig
# 目标芯片
CONFIG_IDF_TARGET="esp32s3"
# Flash 16MB
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# PSRAM（8MB/16MB，音频 buffer 需要）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# 优化等级（音频/HTTP 处理建议 O2）
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL 内置中文字体（屏幕显示对话需要）
# 若 esp-box 的 lv_conf.h 覆盖了 Kconfig 配置（未走 LV_CONF_SKIP），
# 需同时在 <esp-box>/bsp/display/lv_conf.h 里打开 LV_FONT_SIMSUN_16_CJK。
CONFIG_LV_FONT_SIMSUN_16_CJK=y

# 自定义分区表：默认 factory 分区只有 1MB，装不下带 LVGL 的固件
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
